# 함수매핑

## 개별 원소에 함수 매핑

In [2]:
import seaborn as sns

In [3]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
df['ten']=10
df.head()

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [4]:
#함수 정의
def add_10(n) :
    return n + 10
def add_two_obj(a,b) :
    return a+b

print(add_10(10))
print(add_two_obj(10,10))

20
20

In [5]:
sr1 = df['age'].apply(add_10)
sr1.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [6]:
sr2 = df['age'].apply(add_two_obj, b=10)
sr2.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [7]:
sr3 = df['age'].apply(lambda x : add_10(x))
# lambda 함수 활용
sr3.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [10]:
#dt frame에 add_10() 함수를 매핑 적용
df_map = df.applymap(add_10)
df_map.head()

    age     fare  ten
0  32.0  17.2500   20
1  48.0  81.2833   20
2  36.0  17.9250   20
3  45.0  63.1000   20
4  45.0  18.0500   20

## 시리즈 객체에 함수 매핑

In [11]:
#함수정의
def missing_value (series) :
    return series.isnull()

In [12]:
#dt frame에 apply 메소드 적용
result = df.apply(missing_value, axis=0)
result.head()

     age   fare    ten
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [13]:
type(result)

pandas.core.frame.DataFrame

In [14]:
def min_max(x) : #최댓값-최솟값
    return x.max()-x.min()

In [15]:
result = df.apply(min_max)
result

age      79.5800
fare    512.3292
ten       0.0000
dtype: float64

In [16]:
type(result)

pandas.core.series.Series

# 데이터프레임 각 행에 함수 매핑

def add_two_obj(a,b):
    return a+b

In [18]:
# dtf 두개 열에 적용
df['add'] = df.apply(lambda x : add_two_obj(x['age'],x['ten']),axis=1)
df.head()

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

# 데이터프레임 객체에 함수 매핑

In [19]:
#함수정의
def missing_value (x) : # 각 열의 NaN 찾기
    return x.isnull()

def missing_count (x) : # 각 열의 NaN 개수 세기
    return missing_value(x).sum()

def total_number_missing(x) : # 전체 NaN 개수 세기
    return missing_count(x).sum()

In [25]:
result_df = df.pipe(missing_value)
result_df.head()

     age   fare    ten    add
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False

In [23]:
type(result_df)

pandas.core.frame.DataFrame

# pipe()

In [27]:
result_series = df.pipe(missing_count)
result_series

age     177
fare      0
ten       0
add     177
dtype: int64

In [28]:
result_value = df.pipe(total_number_missing)
result_value

354

# 열 재구성
## 열 순서 변경

In [29]:
df = titanic.loc[0:4,'survived':'age']
df

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [30]:
columns = list(df.columns.values)
columns

['survived', 'pclass', 'sex', 'age']

In [31]:
columns_sorted = sorted(columns)
df_sorted = df[columns_sorted] #알파벳 순으로 정렬
df_sorted

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [32]:
columns_reversed = list(reversed(columns))
df_reversed = df[columns_reversed] #알파벳 역순으로 정렬
df_reversed

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

In [33]:
# 사용자가 정한 순서대로 배치학
columns_customed = ['pclass','sex','age','survived']
df_customed = df[columns_customed]
df_customed

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

## 열 분리

In [34]:
import pandas as pd

In [38]:
df = pd.read_excel('/Users/shindongeun/Documents/sample_data/주가데이터.xlsx')
df.head()

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039

In [37]:
df['연월일']=df['연월일'].astype('str')
dates = df['연월일'].str.split('-')
dates.head()

0    [2018, 07, 02]
1    [2018, 06, 29]
2    [2018, 06, 28]
3    [2018, 06, 27]
4    [2018, 06, 26]
Name: 연월일, dtype: object

In [40]:
df['연'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)
df.head()

         연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0 2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1 2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2 2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3 2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4 2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26

## 필터링

In [42]:
mask1 = (titanic.age >=10) & (titanic.age <20)
# 나이가 10~19세 인 승객만 따로 선택
df_teenage = titanic.loc[mask1,:]
df_teenage.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [43]:
mask2 = (titanic.age >=10) & (titanic.sex=='female')
df_female_under10 = titanic.loc[mask2,:]
df_female_under10.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [45]:
mask3 = (titanic.age <10) | (titanic.age >=60)
df_under10_morethan60 = titanic.loc[mask3,['age','sex','alone']]
df_under10_morethan60.head()

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

In [49]:
pd.set_option('display.max_columns',10)

mask3 = titanic['sibsp']==3
mask4 = titanic['sibsp']==4 #함께 탑승한 사람수
mask5 = titanic['sibsp']==5

In [50]:
df_boolin = titanic[mask3|mask4|mask5]
df_boolin.head()

,survived,pclass,sex,age,sibsp,...,adult_male,deck,embark_town,alive,alone
7,0,3,male,2.0,3,...,False,NaN,Southampton,no,False
16,0,3,male,2.0,4,...,False,NaN,Queenstown,no,False
24,0,3,female,8.0,3,...,False,NaN,Southampton,no,False
27,0,1,male,19.0,3,...,True,C,Southampton,no,False
50,0,3,male,7.0,4,...,False,NaN,Southampton,no,False

# 데이터프레임 합치기
## 연결

In [1]:
import pandas as pd

In [7]:
df1 = pd.DataFrame({'a':['a0','a1','a2','a3'],
                   'b':['b0','b1','b2','b3'],
                   'c':['c0','c1','c2','c3']},
                   index = [0,1,2,3])

df2 = pd.DataFrame({'a':['a2','a3','a4','a5'],
                   'b':['b2','b3','b4','b5'],
                   'c':['c2','c3','c4','c5']},
                   index = [2,3,4,5])

In [8]:
result1 = pd.concat([df1,df2])
result1 #위아래 행방향으로 이어붙이기

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
2  a2  b2  c2
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5

In [9]:
result2 = pd.concat([df1,df2],ignore_index=True)
result2 #기존 인덱스 무시하고 위아래 행방향으로 이어붙이기

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
4  a2  b2  c2
5  a3  b3  c3
6  a4  b4  c4
7  a5  b5  c5

In [10]:
result3 = pd.concat([df1,df2],axis=1)
result3 #좌우 열 방향으로 이어 붙이듯 연결하기

     a    b    c    a    b    c
0   a0   b0   c0  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2
3   a3   b3   c3   a3   b3   c3
4  NaN  NaN  NaN   a4   b4   c4
5  NaN  NaN  NaN   a5   b5   c5

In [11]:
result3_in = pd.concat([df1,df2],axis=1,join='inner') # 옵션 : 교집합
result3_in

    a   b   c   a   b   c
2  a2  b2  c2  a2  b2  c2
3  a3  b3  c3  a3  b3  c3

In [13]:
#시리즈 생성
sr1 = pd.Series(['e0','e1','e2','e3'],name='e')
sr2 = pd.Series(['f0','f1','f2'],name='f',index=[3,4,5])
sr3 = pd.Series(['g0','g1','g2','g3'],name='g')

In [15]:
result4= pd.concat([df1,sr1],axis=1)
#좌우 열 방향으로 연결
result4

    a   b   c   e
0  a0  b0  c0  e0
1  a1  b1  c1  e1
2  a2  b2  c2  e2
3  a3  b3  c3  e3

In [17]:
result5 = pd.concat([df2,sr2],axis=1,sort=True)
#좌우 열 방향으로 연결
result5

    a   b   c    f
2  a2  b2  c2  NaN
3  a3  b3  c3   f0
4  a4  b4  c4   f1
5  a5  b5  c5   f2

In [19]:
result6 = pd.concat([sr1,sr3],axis=1)
result6

    e   g
0  e0  g0
1  e1  g1
2  e2  g2
3  e3  g3

In [21]:
result7 = pd.concat([sr1,sr3],axis=0)
result7

0    e0
1    e1
2    e2
3    e3
0    g0
1    g1
2    g2
3    g3
dtype: object

In [22]:
type(result7)

pandas.core.series.Series

## 병합

키 기준으로 병합함

In [23]:
#IPython 디스플레이 설정 변경
pd.set_option('display.max_columns',10) # 출력할 최대 열의 개수
pd.set_option('display.max_colwidth',20) # 출력할 열의 너비
pd.set_option('display.unicode.east_asian_width',True) # 유니코드 사용 너비 조정

In [24]:
df1= pd.read_excel('/Users/shindongeun/Documents/sample_data/stock price.xlsx')
df2 = pd.read_excel('/Users/shindongeun/Documents/sample_data/stock valuation.xlsx')

In [28]:
merge_inner = pd.merge(df1,df2) #교집합으로 합치기
# merge 함수는 on=None (모든 열을 기준(키)으로 병합) 과 how=inner (교집합 출력)이 기본값 내장돼있다.
merge_inner

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,이마트,239230.833333,254500,이마트,18268.166667,295780,13.931338,0.860437
2,145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090,14.283226,0.758627
3,185750,종근당,40293.666667,100500,종근당,3990.333333,40684,25.185866,2.470259
4,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

In [30]:
# 합집합
merge_outer = pd.merge(df1,df2,how='outer',on='id')
merge_outer

,id,stock_name,value,price,name,eps,bps,per,pbr
0,128940,한미약품,59385.666667,421000.0,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,엔에스쇼핑,14558.666667,13200.0,NaN,NaN,NaN,NaN,NaN
3,139480,이마트,239230.833333,254500.0,이마트,18268.166667,295780.0,13.931338,0.860437
4,142280,녹십자엠에스,468.833333,10200.0,NaN,NaN,NaN,NaN,NaN
5,145990,삼양사,82750.000000,82000.0,삼양사,5741.000000,108090.0,14.283226,0.758627
6,185750,종근당,40293.666667,100500.0,종근당,3990.333333,40684.0,25.185866,2.470259
7,192400,쿠쿠홀딩스,179204.666667,177500.0,NaN,NaN,NaN,NaN,NaN
8,199800,툴젠,-2514.333333,115400.0,NaN,NaN,NaN,NaN,NaN
9,204210,모두투어리츠,3093.333333,3475.0,모두투어리츠,85.166667,5335.0,40.802348,0.651359
10,136480,NaN,NaN,NaN,하림,274.166667,3551.0,11.489362,0.887074
11,138040,NaN,NaN,NaN,메리츠금융지주,2122.333333,14894.0,6.313806,0.899691
12,161390,NaN,NaN,NaN,한국타이어,5648.500000,51341.0,7.453306,0.820007
13,181710,NaN,NaN,NaN,NHN엔터테인먼트,2110.166667,78434.0,30.755864,0.827447
14,207940,NaN,NaN,NaN,삼성바이오로직스,4644.166667,60099.0,89.790059,6.938551

In [32]:
merge_left = pd.merge(df1,df2,how='left',left_on='stock_name',right_on='name')
#left 옵션은 왼쪽 dtframe의 키 열에 속하는 데이터 값 기분으로 병합한다.
# _on으로 양쪽 데이터프레임의 키 열을 다르게 지정할 수 있다.
merge_left

,id_x,stock_name,value,price,id_y,name,eps,bps,per,pbr
0,128940,한미약품,59385.666667,421000,NaN,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900,130960.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,엔에스쇼핑,14558.666667,13200,NaN,NaN,NaN,NaN,NaN,NaN
3,139480,이마트,239230.833333,254500,139480.0,이마트,18268.166667,295780.0,13.931338,0.860437
4,142280,녹십자엠에스,468.833333,10200,NaN,NaN,NaN,NaN,NaN,NaN
5,145990,삼양사,82750.000000,82000,145990.0,삼양사,5741.000000,108090.0,14.283226,0.758627
6,185750,종근당,40293.666667,100500,185750.0,종근당,3990.333333,40684.0,25.185866,2.470259
7,192400,쿠쿠홀딩스,179204.666667,177500,NaN,NaN,NaN,NaN,NaN,NaN
8,199800,툴젠,-2514.333333,115400,NaN,NaN,NaN,NaN,NaN,NaN
9,204210,모두투어리츠,3093.333333,3475,204210.0,모두투어리츠,85.166667,5335.0,40.802348,0.651359

In [33]:
merge_right = pd.merge(df1,df2,how='right',left_on='stock_name',right_on='name')
#right 옵션은 오른쪽 dtframe의 키 열에 속하는 데이터 값 기분으로 병합한다.
# _on으로 양쪽 데이터프레임의 키 열을 다르게 지정할 수 있다.
merge_right

,id_x,stock_name,value,price,id_y,name,eps,bps,per,pbr
0,130960.0,CJ E&M,58540.666667,98900.0,130960,CJ E&M,6301.333333,54068,15.695091,1.829178
1,NaN,NaN,NaN,NaN,136480,하림,274.166667,3551,11.489362,0.887074
2,NaN,NaN,NaN,NaN,138040,메리츠금융지주,2122.333333,14894,6.313806,0.899691
3,139480.0,이마트,239230.833333,254500.0,139480,이마트,18268.166667,295780,13.931338,0.860437
4,145990.0,삼양사,82750.000000,82000.0,145990,삼양사,5741.000000,108090,14.283226,0.758627
5,NaN,NaN,NaN,NaN,161390,한국타이어,5648.500000,51341,7.453306,0.820007
6,NaN,NaN,NaN,NaN,181710,NHN엔터테인먼트,2110.166667,78434,30.755864,0.827447
7,185750.0,종근당,40293.666667,100500.0,185750,종근당,3990.333333,40684,25.185866,2.470259
8,204210.0,모두투어리츠,3093.333333,3475.0,204210,모두투어리츠,85.166667,5335,40.802348,0.651359
9,NaN,NaN,NaN,NaN,207940,삼성바이오로직스,4644.166667,60099,89.790059,6.938551

In [34]:
# 불린 인덱싱과 결합해 원하는 데이터 찾기
price = df1[df1['price']<50000] # 1. 원하는 데이터 저장 후, 
price.head()

       id    stock_name         value  price
2  138250    엔에스쇼핑  14558.666667  13200
4  142280  녹십자엠에스    468.833333  10200
9  204210  모두투어리츠   3093.333333   3475

In [35]:
value = pd.merge(price,df2) # 2. 병합한다.
value

,id,stock_name,value,price,name,eps,bps,per,pbr
0,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

In [37]:
df1= pd.read_excel('/Users/shindongeun/Documents/sample_data/stock price.xlsx',index_col='id')
df2 = pd.read_excel('/Users/shindongeun/Documents/sample_data/stock valuation.xlsx',index_col='id')

df3 = df1.join(df2) # 행 인덱스 기준으로 결합
df3

,stock_name,value,price,name,eps,bps,per,pbr
id,,,,,,,,
128940,한미약품,59385.666667,421000,NaN,NaN,NaN,NaN,NaN
130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068.0,15.695091,1.829178
138250,엔에스쇼핑,14558.666667,13200,NaN,NaN,NaN,NaN,NaN
139480,이마트,239230.833333,254500,이마트,18268.166667,295780.0,13.931338,0.860437
142280,녹십자엠에스,468.833333,10200,NaN,NaN,NaN,NaN,NaN
145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090.0,14.283226,0.758627
185750,종근당,40293.666667,100500,종근당,3990.333333,40684.0,25.185866,2.470259
192400,쿠쿠홀딩스,179204.666667,177500,NaN,NaN,NaN,NaN,NaN
199800,툴젠,-2514.333333,115400,NaN,NaN,NaN,NaN,NaN
204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335.0,40.802348,0.651359

In [40]:
df4 = df1.join(df2,how='inner')
# 교집합인 행 인덱스를 추출 (id열 기준으로)
df4

,stock_name,value,price,name,eps,bps,per,pbr
id,,,,,,,,
130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
139480,이마트,239230.833333,254500,이마트,18268.166667,295780,13.931338,0.860437
145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090,14.283226,0.758627
185750,종근당,40293.666667,100500,종근당,3990.333333,40684,25.185866,2.470259
204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

# 그룹연산
## 그룹 객체 만들기 (분할단계)

In [42]:
import pandas as pd
import seaborn as sns

In [43]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','sex','class','fare','survived']]
print('승객 수 : ',len(df))
print(df.head())

승객 수 :  891
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [44]:
grouped = df.groupby(['class'])
grouped #class열 기준으로 분할

In [46]:
# 그룹 객체를 iteration으로 출력 : head() 메소드로 첫 5행만을 출력
for key, group in grouped :
    print('* key: ',key)
    print('* number: ',len(group))
    print(group.head())
    print('*'*60)

* key:  First
* number:  216
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1
************************************************************
* key:  Second
* number:  184
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1
************************************************************
* key:  Third
* number:  491
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0
************************************************************

In [47]:
average = grouped.mean()
print(average)

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [48]:
# 3개 그룹 중 key 값이 third 인 3등석 승객 그룹을 선택해 추출
group3 = grouped.get_group('Third')
group3.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [49]:
grouped_two = df.groupby(['class','sex']) # 2중 멀티 인덱스

for key, group in grouped_two :
    print('* key: ',key)
    print('* number: ',len(group))
    print(group.head())
    print('*'*60)

* key:  ('First', 'female')
* number:  94
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1
************************************************************
* key:  ('First', 'male')
* number:  122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0
************************************************************
* key:  ('Second', 'female')
* number:  76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1
************************************************************
* key:  ('Second', 'male')
* number:  108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0
************************************************************
* key:  ('Third', 'female')
* number:  144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0
************************************************************
* key:  ('Third', 'male')
* number:  347
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0
************************************************************

In [51]:
# grouped_two 객체에 연산 메소드 적용
average_two = grouped_two.mean()
print(average_two)
type(average_two)

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

pandas.core.frame.DataFrame

In [52]:
group3f = grouped_two.get_group(('Third','female')) # 튜플의 키인 class, sex를 반환한다.
group3f.head()

     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0

In [53]:
grouped = df.groupby(['class'])

std_all = grouped.std() #데이터 집계 : 표준편차 구하기
std_all

              age       fare  survived
class
First   14.802856  78.380373  0.484026
Second  14.001077  13.417399  0.500623
Third   12.495398  11.778142  0.428949

In [57]:
std_fare = grouped.fare.std()
print(std_fare)
print(type(std_fare))

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64
<class 'pandas.core.series.Series'>

In [59]:
def min_max(x) :
    return x.max() - x.min() # 각 그룹의 최대값 , 최소값의 차이를 계산해 그룹별로 집계
agg_minmax = grouped.agg(min_max)
agg_minmax.head()

/var/folders/g0/7n9481cx3xx1dj4nqkh7r1980000gn/T/ipykernel_6273/3055870267.py:3: FutureWarning: ['sex'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  agg_minmax = grouped.agg(min_max)

          age      fare  survived
class
First   79.08  512.3292         1
Second  69.33   73.5000         1
Third   73.58   69.5500         1

In [60]:
agg_all = grouped.agg(['min','max']) 
# 여러 함수를 각 열에 동일하게 적용해 집계
agg_all.head()

         age           sex       fare           survived
         min   max     min   max  min       max      min max
class
First   0.92  80.0  female  male  0.0  512.3292        0   1
Second  0.67  70.0  female  male  0.0   73.5000        0   1
Third   0.42  74.0  female  male  0.0   69.5500        0   1

In [61]:
agg_sep = grouped.agg({'fare' : ['min','max'], 'age' : 'mean'})
# 각 열마다 다른 함수를 적용해 집계
agg_sep.head()

       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620

In [62]:
age_mean = grouped.age.mean() # age 열의 평균 집계 연산
age_mean

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64

In [63]:
age_std = grouped.age.std() # age 열의 표준편차 집계 연산
age_std

class
First     14.802856
Second    14.001077
Third     12.495398
Name: age, dtype: float64

In [64]:
for key, group in grouped.age :
    group_zscore = (group-age_mean.loc[key])/age_std.loc[key]
    # 그룹 객체의 age 열을 iteration으로 z-score를 계산해 출력
    print('* origin :',key)
    print(group_zscore.head(3))
    # 각 그룹의 첫 3개 행 출력
    print('*'*60)

* origin : First
1   -0.015770
3   -0.218434
6    1.065103
Name: age, dtype: float64
************************************************************
* origin : Second
9    -1.134029
15    1.794317
17         NaN
Name: age, dtype: float64
************************************************************
* origin : Third
0   -0.251342
2    0.068776
4    0.789041
Name: age, dtype: float64
************************************************************

In [65]:
#x_score를 계싼하는 사용자 함수 정의
def z_score(x) :
    return (x - x.mean())/x.std()

# transform() 메소드를 활용해 age 열의 데이터를 z-score로 변환
age_zscore = grouped.age.transform(z_score)
print(age_zscore.loc[[1,9,0]]) #1,2,3 group의 첫 데이터 확인 (변환 결과)
print('\n')
print(len(age_zscore)) # 변환값의 길이
print('\n')
print(age_zscore.loc[0:9]) # 반환 값 출력 ( 첫 10개만 )
print('\n')
print(type(age_zscore)) # 자료형 확인

1   -0.015770
9   -1.134029
0   -0.251342
Name: age, dtype: float64


891


0   -0.251342
1   -0.015770
2    0.068776
3   -0.218434
4    0.789041
5         NaN
6    1.065103
7   -1.851931
8    0.148805
9   -1.134029
Name: age, dtype: float64


<class 'pandas.core.series.Series'>

In [67]:
# 그룹 객체 필터링 : group.객체.filter(조건식함수)

grouped_filter = grouped.filter(lambda x: len(x) >=200)
# data 개수가 200개 이상인 그룹만을 필터링 , 데이터프레임으로 변환
print(grouped_filter.head())
print('\n')
print(type(grouped_filter))

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0


<class 'pandas.core.frame.DataFrame'>

In [68]:
age_filter = grouped.filter(lambda x:x.age.mean() < 30)
print(age_filter.head())
print('\n')
print(type(age_filter))

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0


<class 'pandas.core.frame.DataFrame'>

In [69]:
# 그룹 객체에 함수 매핑 : group 객체.apply(매핑 함수)

agg_grouped = grouped.apply(lambda x: x.describe())
# 집계 : 각 그룹별 요약 통계 정보 집계
print(agg_grouped)

                     age        fare    survived
class
First  count  186.000000  216.000000  216.000000
       mean    38.233441   84.154687    0.629630
       std     14.802856   78.380373    0.484026
       min      0.920000    0.000000    0.000000
       25%     27.000000   30.923950    0.000000
       50%     37.000000   60.287500    1.000000
       75%     49.000000   93.500000    1.000000
       max     80.000000  512.329200    1.000000
Second count  173.000000  184.000000  184.000000
       mean    29.877630   20.662183    0.472826
       std     14.001077   13.417399    0.500623
       min      0.670000    0.000000    0.000000
       25%     23.000000   13.000000    0.000000
       50%     29.000000   14.250000    0.000000
       75%     36.000000   26.000000    1.000000
       max     70.000000   73.500000    1.000000
Third  count  355.000000  491.000000  491.000000
       mean    25.140620   13.675550    0.242363
       std     12.495398   11.778142    0.428949
       min      0.420000    0.000000    0.000000
       25%     18.000000    7.750000    0.000000
       50%     24.000000    8.050000    0.000000
       75%     32.000000   15.500000    0.000000
       max     74.000000   69.550000    1.000000

In [70]:
# z-score를 계산하는 사용자 함수 정의
def z_score(x) :
    return (x - x.mean())/x.std()

age_zscore = grouped.age.apply(z_score) # 기본값 axis = 0
age_zscore.head()

0   -0.251342
1   -0.015770
2    0.068776
3   -0.218434
4    0.789041
Name: age, dtype: float64

In [74]:
# filtering : age 열의 데이터 평균이 30보다 작은 그룹만을 필터링해 출력

age_filter = grouped.filter(lambda x:x.age.mean() < 30)
print(age_filter)

for x in age_filter.index :
    if age_filter[x] == True :
        age_filter_df = grouped.get_group(x)
        print(age_filter_df.head())
        print('\n')

      age     sex   class     fare  survived
0    22.0    male   Third   7.2500         0
2    26.0  female   Third   7.9250         1
4    35.0    male   Third   8.0500         0
5     NaN    male   Third   8.4583         0
7     2.0    male   Third  21.0750         0
..    ...     ...     ...      ...       ...
884  25.0    male   Third   7.0500         0
885  39.0  female   Third  29.1250         0
886  27.0    male  Second  13.0000         0
888   NaN  female   Third  23.4500         0
890  32.0    male   Third   7.7500         0

[675 rows x 5 columns]

KeyError: 0

# 멀티 인덱스

In [75]:
grouped = df.groupby(['class','sex'])

gdf = grouped.mean()
gdf

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [77]:
print(gdf.loc['First'])

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [78]:
gdf.loc[('First','female')]

age          34.611765
fare        106.125798
survived      0.968085
Name: (First, female), dtype: float64

In [79]:
gdf.xs('male',level = 'sex') # xs도 인덱서의 한 종류

              age       fare  survived
class
First   41.281386  67.226127  0.368852
Second  30.740707  19.741782  0.157407
Third   26.507589  12.661633  0.135447

# 피벗

엑셀의 피벗테이블과 비슷한 기능

In [80]:
#IPython 디스플레이 설정 변경
pd.set_option('display.max_columns',10) # 출력할 최대 열의 개수
pd.set_option('display.max_colwidth',20) # 출력할 열의 너비

pdf1 = pd.pivot_table(df, # 피벗할 데이터프레임
                     index='class', # 행 위칭 들어갈 열
                     columns='sex', # 열 위치에 들어갈 열
                     values='age', # 데이터로 사용할 열
                     aggfunc='mean') # 데이터 집계 함수
pdf1.head()

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [81]:
pdf2 = pd.pivot_table(df, # 피벗할 데이터프레임
                     index='class', # 행 위칭 들어갈 열
                     columns='sex', # 열 위치에 들어갈 열
                     values='survived', # 데이터로 사용할 열
                     aggfunc=['mean','sum']) # 데이터 집계 함수
pdf2.head()

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

In [82]:
pdf3 = pd.pivot_table(df, # 피벗할 데이터프레임
                     index=['class','sex'], # 행 위칭 들어갈 열
                     columns='survived', # 열 위치에 들어갈 열
                     values=['age','fare'], # 데이터로 사용할 열
                     aggfunc=['mean','max']) # 데이터 집계 함수

pd.set_option('display.max_columns',10)
pdf3.head()

                    mean                                      max        \
                     age                   fare               age
survived               0          1           0           1     0     1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0


                 fare
survived            0         1
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875

In [83]:
print(pdf3.xs('First'))

               mean                                      max                \
                age                   fare               age          fare
survived          0          1           0           1     0     1       0
sex
female    25.666667  34.939024  110.604167  105.978159  50.0  63.0  151.55
male      44.581967  36.248000   62.894910   74.637320  71.0  80.0  263.00



survived         1
sex
female    512.3292
male      512.3292

In [85]:
print(pdf3.xs(('First','female')))

            survived
mean  age   0            25.666667
            1            34.939024
      fare  0           110.604167
            1           105.978159
max   age   0            50.000000
            1            63.000000
      fare  0           151.550000
            1           512.329200
Name: (First, female), dtype: float64

In [86]:
print(pdf3.xs('male',level='sex'))

               mean                                    max                \
                age                  fare              age          fare
survived          0          1          0          1     0     1       0
class
First     44.581967  36.248000  62.894910  74.637320  71.0  80.0  263.00
Second    33.369048  16.022000  19.488965  21.095100  70.0  62.0   73.50
Third     27.255814  22.274211  12.204469  15.579696  74.0  45.0   69.55



survived         1
class
First     512.3292
Second     39.0000
Third      56.4958

In [88]:
print(pdf3.xs(('Second','male'),level=[0,'sex']))

                  mean                               max
                   age               fare            age        fare
survived             0       1          0        1     0     1     0     1
class  sex
Second male  33.369048  16.022  19.488965  21.0951  70.0  62.0  73.5  39.0

In [89]:
print(pdf3.xs('mean',axis=1))

                     age                   fare
survived               0          1           0           1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159
       male    44.581967  36.248000   62.894910   74.637320
Second female  36.000000  28.080882   18.250000   22.288989
       male    33.369048  16.022000   19.488965   21.095100
Third  female  23.818182  19.329787   19.773093   12.464526
       male    27.255814  22.274211   12.204469   15.579696

In [90]:
print(pdf3.xs(1,level='survived',axis=1))

                    mean               max
                     age        fare   age      fare
class  sex
First  female  34.939024  105.978159  63.0  512.3292
       male    36.248000   74.637320  80.0  512.3292
Second female  28.080882   22.288989  55.0   65.0000
       male    16.022000   21.095100  62.0   39.0000
Third  female  19.329787   12.464526  63.0   31.3875
       male    22.274211   15.579696  45.0   56.4958

In [91]:
print(pdf3.xs(('max','fare',0),level=[0,1,2],axis=1))

                  max
                 fare
survived            0
class  sex
First  female  151.55
       male    263.00
Second female   26.00
       male     73.50
Third  female   69.55
       male     69.55